nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Sys_config.c
	 //  记录 
         Api_DFdirectory_Create(spd_warn,spd_warn_size);      // 超速报警   
	  Api_DFdirectory_Create(tired_warn,tired_warn_size);    // 疲劳驾驶
	  Api_DFdirectory_Create(doubt_data,doubt_data_size);   // 事故疑点
	  Api_DFdirectory_Create(spdpermin,spdpermin_size);    // 每分钟平均速度
	  Api_DFdirectory_Create(pospermin,pospermin_size);    //  每分钟位置信息  
	  Api_MediaIndex_Init();    //  多媒体索引   图片+  语音
	 // Api_DFdirectory_Create(pic_index,pic_index_size);    //  图片索引
	 // Api_DFdirectory_Create(voice_index,voice_index_size);    //  声音索引


	  // 拍照
	   Api_DFdirectory_Create(camera_1,camera_1_size);   //    4 路拍照，每路 32K  
	   Api_DFdirectory_Create(camera_2,camera_2_size); 
          Api_DFdirectory_Create(camera_3,camera_3_size); 
	   Api_DFdirectory_Create(camera_4,camera_4_size); 	    

	  //  录音 
         Api_DFdirectory_Create(voice,voice_size);    //  语音信息  

}

/*
        删除既有目录内容
*/
#if 0
void  Delete_exist_Directory(void)
{
            //  配置 
         Api_DFdirectory_Delete(config);      //   sysconfig
         Api_DFdirectory_Delete(jt808);       
         Api_DFdirectory_Delete(tired_config);        //   疲劳驾驶配置

        //   循环存储
         Api_DFdirectory_Delete(cyc_gps);      

	//  固定序号	 
         Api_DFdirectory_Delete(msg_broadcast);   //  播放消息
         Api_DFdirectory_Delete(phonebook);         //   电话本
         Api_DFdirectory_Delete(Rail_cycle);  
         Api_DFdirectory_Delete(Rail_rect);  
         Api_DFdirectory_Delete(Rail_polygen);  
         Api_DFdirectory_Delete(turn_point);        // 拐点 
	     Api_DFdirectory_Delete(route_line);    // 路线
	     Api_DFdirectory_Delete(ask_quesstion);    // 提问
	     Api_DFdirectory_Delete(text_msg);   //  文本信息  


	 //  记录 
         Api_DFdirectory_Delete(spd_warn);      // 超速报警   
	  Api_DFdirectory_Delete(tired_warn);    // 疲劳驾驶
	  Api_DFdirectory_Delete(doubt_data);   // 事故疑点
	  Api_DFdirectory_Delete(spdpermin);    // 每分钟平均速度
	  Api_DFdirectory_Delete(pospermin);    //  每分钟位置信息    
	  Api_DFdirectory_Delete(pic_index);    //  图片索引
	  Api_DFdirectory_Delete(voice_index); //  语音索引


}  
#endif

/*
       系统配置信息写入
*/
u8  SysConfig_init(void)
{
	  
       //  1. Stuff
	                 //   系统版本
	        SysConf_struct.Version_ID=SYSID; 
	                         //   APN  
		memset((u8*)SysConf_struct.APN_str,0 ,sizeof(SysConf_struct.APN_str));
		memcpy(SysConf_struct.APN_str,(u8*)APN_String,strlen((const char*)APN_String));  
	                        //   域名main 
		memset((u8*)SysConf_struct.DNSR,0 ,sizeof(SysConf_struct.DNSR));
		memcpy(SysConf_struct.DNSR,(u8*)DomainNameStr,strlen((const char*)DomainNameStr)); 
                            //   域名aux
		memset((u8*)SysConf_struct.DNSR_Aux,0 ,sizeof(SysConf_struct.DNSR_Aux));
		memcpy(SysConf_struct.DNSR_Aux,(u8*)DomainNameStr_aux,strlen((const char*)DomainNameStr_aux));   
		

			 
	        //   主 IP   +  端口
	        memcpy(SysConf_struct.IP_Main,(u8*)RemoteIP_main,4); 
	        SysConf_struct.Port_main=RemotePort_main;
	       //   备用 IP   +  端口
	        memcpy(SysConf_struct.IP_Aux,(u8*)RemoteIP_aux,4); 
	        SysConf_struct.Port_Aux=RemotePort_aux;	 				 

           //   LINK2 +      端口           
		   memcpy(SysConf_struct.Link2_IP,(u8*)Remote_Link2_IP,4); 
		   SysConf_struct.Link2_Port=Remote_Link2_Port;  					


           
				//	 IC 卡中心IP   TCP 端口 UDP  端口
				 memcpy(SysConf_struct.BD_IC_main_IP,(u8*)RemoteIP_aux,4);
		   SysConf_struct.BD_IC_TCP_port=RemotePort_aux;	  
		   SysConf_struct.BD_IC_UDP_port=29;


	       //  传感器触发上报状态
	       SysConf_struct.TriggerSDsatus=TriggerSDsatus;
		//   ACC  on   off  设置
		SysConf_struct.AccOn_Dur=ACC_on_sd_Duration;
		SysConf_struct.AccOff_Dur=ACC_off_sd_Duration; 
   //    2. Operate
            return(Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct)));       

}

void SysConfig_Read(void)
{
        if( Api_Config_read(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct))==false)   //读取系统配置信息
                      rt_kprintf("\r\nConfig_ Read Error\r\n");   

			
 		memset((u8*)APN_String,0 ,sizeof(APN_String)); 
		memcpy((u8*)APN_String,SysConf_struct.APN_str,strlen((const char*)SysConf_struct.APN_str));  
	                        //   域名
		memset((u8*)DomainNameStr,0 ,sizeof(DomainNameStr));
		memcpy((u8*)DomainNameStr,SysConf_struct.DNSR,strlen((const char*)SysConf_struct.DNSR)); 
	                        //   域名aux
		memset((u8*)DomainNameStr_aux,0 ,sizeof(DomainNameStr_aux));
		memcpy((u8*)DomainNameStr_aux,SysConf_struct.DNSR_Aux,strlen((const char*)SysConf_struct.DNSR_Aux)); 

		
			 
	        //   主 IP   +  端口
	        memcpy((u8*)RemoteIP_main,SysConf_struct.IP_Main,4); 
	        RemotePort_main=SysConf_struct.Port_main;
	       //   备用 IP   +  端口
	        memcpy((u8*)RemoteIP_aux,SysConf_struct.IP_Aux,4); 
	        RemotePort_aux=SysConf_struct.Port_Aux;	 		
		   //  Link2  
	        memcpy((u8*)Remote_Link2_IP,SysConf_struct.Link2_IP,4); 
	        Remote_Link2_Port=SysConf_struct.Link2_Port;	 				 

	       //  传感器触发上报状态
	        TriggerSDsatus=SysConf_struct.TriggerSDsatus;
		//   ACC  on   off  设置
		ACC_on_sd_Duration=SysConf_struct.AccOn_Dur;
		ACC_off_sd_Duration=SysConf_struct.AccOff_Dur;              


}


/*
       JT808    Related 
*/
void JT808_DURATION_Init(void)
{
    JT808Conf_struct.DURATION.Heart_Dur=60;       // 心跳包发送间隔 
	JT808Conf_struct.DURATION.TCP_ACK_Dur=20;     //  TCP 应答超时
	JT808Conf_struct.DURATION.TCP_ReSD_Num=3;     //  TCP 重发次数
	JT808Conf_struct.DURATION.TCP_ACK_Dur=20;     //  UDP 应答超时
	JT808Conf_struct.DURATION.UDP_ReSD_Num=5;     //  UDP 重发次数
 	JT808Conf_struct.DURATION.NoDrvLogin_Dur=40;  //  驾驶员没登陆时的发送间隔
 	JT808Conf_struct.DURATION.Sleep_Dur=30;       //  休眠时上报的时间间隔    
	JT808Conf_struct.DURATION.Emegence_Dur=20;    //  紧急报警时上报时间间隔
	JT808Conf_struct.DURATION.Default_Dur=30;     //  缺省情况下上报的时间间隔
	JT808Conf_struct.DURATION.SD_Delta_maxAngle=60; // 拐点补传的最大角度
	JT808Conf_struct.DURATION.IllgleMovo_disttance=300; // 非法移动阈值  
}

void JT808_SendDistances_Init(void)
{
   JT808Conf_struct.DISTANCE.Defalut_DistDelta=200;    // 默认定距回传距离
   JT808Conf_struct.DISTANCE.NoDrvLogin_Dist=300;      // 驾驶员未登录时回传距离
   JT808Conf_struct.DISTANCE.Sleep_Dist=500;           // 休眠情况下上报的定距回传
   JT808Conf_struct.DISTANCE.Emergen_Dist=100;         // 紧急报警情况下上报的定距回传 
}

//------------------------- 终端数据发送方式 -----------------------
void JT808_SendMode_Init(void)
{
  JT808Conf_struct.SD_MODE.DUR_TOTALMODE=1;  // 使能定时发送
  JT808Conf_struct.SD_MODE.Dur_DefaultMode=1; //  缺省方式上报
  JT808Conf_struct.SD_MODE.Dur_EmegencMode=0;
  JT808Conf_struct.SD_MODE.Dur_NologinMode=0;
  JT808Conf_struct.SD_MODE.Dur_SleepMode=0;

  JT808Conf_struct.SD_MODE.DIST_TOTALMODE=0;
  JT808Conf_struct.SD_MODE.Dist_DefaultMode=0;
  JT808Conf_struct.SD_MODE.Dist_EmgenceMode=0;
  JT808Conf_struct.SD_MODE.Dist_NoLoginMode=0;
  JT808Conf_struct.SD_MODE.Dist_SleepMode=0;

  
  JT808Conf_struct.SD_MODE.Send_strategy=0; 
}

//------------------------------------------------------------------
void  JT808_RealTimeLock_Init(void)
{                         // 预设值默认值     
   JT808Conf_struct.RT_LOCK.Lock_state=0;
   JT808Conf_struct.RT_LOCK.Lock_Dur=20;   
   JT808Conf_struct.RT_LOCK.Lock_KeepDur=300;
   JT808Conf_struct.RT_LOCK.Lock_KeepCnter=0;
}

void  Vehicleinfo_Init(void) 
{
	memset((u8*)&Vechicle_Info,0,sizeof(Vechicle_Info));
	//-----------------------------------------------------------------------
	memcpy(Vechicle_Info.Vech_VIN,"00000000000000000",17);
	memcpy(Vechicle_Info.Vech_Num,"津A00000",8);        
	memcpy(Vechicle_Info.Vech_Type,"未知型",6);       
	Vechicle_Info.Dev_ProvinceID=12;  // 默认省ID   0      13  河北省
	Vechicle_Info.Dev_CityID=101;      // 默认市ID   0		 石家庄 
	Vechicle_Info.Dev_Color=1;       // 默认颜色    // JT415    1  蓝 2 黄 3 黑 4 白 9其他     
	//Vechicle_Info.loginpassword_flag=0;
	Vechicle_Info.Link_Frist_Mode=0; //     0  : dnsr first     1: mainlink  first  

	DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));  
	
