nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Sys_config.c
	WatchDog_Feed();
	DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
	
	WatchDog_Feed();
	DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
	
}

u8     JT808_Conf_init( void ) 
  {
         u8  FirstUseDate[6]={0,0,0,0,0,0};
            //  1.  clear
                    memset((u8*)&(JT808Conf_struct),0,sizeof(JT808Conf_struct)); 	  // 驾驶员信息						

		  
        //   2.  Stuff 
  		   JT808_DURATION_Init();
                         //  JT808Conf_struct.
                 JT808_SendDistances_Init();
		   JT808_SendMode_Init();
		   JT808Conf_struct.LOAD_STATE=0; //  负载状态		   
		   JT808Conf_struct.PositionSd_Stratage=0; // 根据ACC 状态
		   
		   memset((u8*)JT808Conf_struct.ConfirmCode,0,sizeof(JT808Conf_struct.ConfirmCode));
		   memcpy((u8*)JT808Conf_struct.ConfirmCode,"012345\x00",7); //  鉴权码

		   JT808Conf_struct.Regsiter_Status=0;   //  注册状态 

		   memset((u8*)JT808Conf_struct.LISTEN_Num,0,sizeof(JT808Conf_struct.LISTEN_Num));
		   memcpy((u8*)JT808Conf_struct.LISTEN_Num,"10086",5); //  监听号码

		   
		   	
		   memset((u8*)JT808Conf_struct.SMS_RXNum,0,sizeof(JT808Conf_struct.SMS_RXNum));
		   memcpy((u8*)JT808Conf_struct.SMS_RXNum,"106220801",9); //  监听号码

                 JT808Conf_struct.Vech_Character_Value=6240; // 特征系数  速度脉冲系数 



		   memset((u8*)JT808Conf_struct.FirstSetupDate,0,sizeof(JT808Conf_struct.FirstSetupDate));
		   memcpy((u8*)JT808Conf_struct.FirstSetupDate,FirstUseDate,6); // 首次安装时间
  

                 memset((u8*)JT808Conf_struct.DeviceOnlyID,0,sizeof(JT808Conf_struct.DeviceOnlyID));
		   memcpy((u8*)JT808Conf_struct.DeviceOnlyID,"00000010000000000000001",23);   //   行车记录仪的唯一ID

		   JT808Conf_struct.Msg_Float_ID=0;   // 消息流水号

  
		

                JT808Conf_struct.Distance_m_u32=0;            //  行驶记录仪行驶里程  单位: 米
                JT808Conf_struct.DayStartDistance_32=0;     //  每天的起始里程数目

                JT808Conf_struct.Speed_warn_MAX=200;           //  速度报警门限
                JT808Conf_struct.Spd_Exd_LimitSeconds=10;  //  超速报警持续时间门限 s
                JT808Conf_struct.Speed_GetType=0;             //  记录仪获取速度的方式  00  gps取速度  01 表示从传感器去速度 
                JT808Conf_struct.DF_K_adjustState=0; // 特征系数自动校准状态说明  1:自动校准过    0:尚未自动校准   

   	
                JT808Conf_struct.OutGPS_Flag=1;     //  0  默认  1  接外部有源天线 
                JT808Conf_struct.concuss_step=40;
				JT808Conf_struct.Auto_ATA_flag=0; // 不启用自动接听  
				
		   JT808_RealTimeLock_Init();   //  实时跟踪设置	

		    		 
                 memset((u8*)&(JT808Conf_struct.StdVersion),0,sizeof(JT808Conf_struct.StdVersion));  // 标准国家版本 
  		   memcpy((u8*)(JT808Conf_struct.StdVersion.stdverStr),"GB/T19056-2011",14); // 标准版本 
  	          JT808Conf_struct.StdVersion.MdfyID=0x02; //修改单号



		  memset((u8*)&(JT808Conf_struct.Driver_Info),0,sizeof(JT808Conf_struct.Driver_Info)); 	  // 驾驶员信息						
		//--------------------------------------------------------------------------
		
		  memcpy(JT808Conf_struct.Driver_Info.DriveCode,"000",3);  
		  memcpy(JT808Conf_struct.Driver_Info.DriverCard_ID,"000000000000000000",18);  
		  memcpy(JT808Conf_struct.Driver_Info.DriveName,"未知",4);   
		  memcpy(JT808Conf_struct.Driver_Info.Driver_ID,"000000000000000000",18);  
		  memcpy(JT808Conf_struct.Driver_Info.Drv_CareerID,"0000000000000000000000000000000000000000",40); 
		  memcpy(JT808Conf_struct.Driver_Info.Comfirm_agentID,"000000000000000",16);
							
       

       //    3. Operate
            return(Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)));       

  }

void TIRED_DoorValue_Init(void)
{
    TiredConf_struct.TiredDoor.Door_DrvKeepingSec=14400;  // 国家标准是 3小时        
    TiredConf_struct.TiredDoor.Door_MinSleepSec=1200;     // 
    TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec=28800; //8小时
    TiredConf_struct.TiredDoor.Door_MaxParkingSec=7200;  // 2 小时  
    TiredConf_struct.TiredDoor.Parking_currentcnt=0;  // 停车状态计数器      
}

void  TIRED_Drive_Init(void)
{
          //--------- 复位时 疲劳驾驶ACC on off 计数相关  ---      
	 TiredConf_struct.Tired_drive.Status_TiredwhRst=0;;
	 TiredConf_struct.Tired_drive.Tireddrv_status=0;;
	 TiredConf_struct.Tired_drive.Flag=0;
	 TiredConf_struct.Tired_drive.ACC_ONstate_counter=0;
	 TiredConf_struct.Tired_drive.ACC_Offstate_counter=0;

        TiredConf_struct.Tired_drive.Tgvoice_play=0;
	 TiredConf_struct.Tired_drive.voicePly_counter=0;
	 TiredConf_struct.Tired_drive.voicePly_timer=0;
	 
	 TiredConf_struct.Tired_drive.PreWarn_Dur=1200;  //疲劳驾驶预报警
	 TiredConf_struct.Tired_drive.CurrentDay_DriveTimer_0=0;         //  上报策略为  0 时 
     TiredConf_struct.Tired_drive.CurrentDay_DriveTimer_Driver_1=0;  // 上报策略为1 时
     TiredConf_struct.Tired_drive.CurrentDay_DriveTimer_Driver_2=0; //  上报策略为1 时


         //--- below again ---
	   TiredConf_struct.Tired_drive.ACC_ONstate_counter=0;
	   TiredConf_struct.Tired_drive.ACC_Offstate_counter=0;
	   TiredConf_struct.Tired_drive.Tgvoice_play=0;
	   TiredConf_struct.Tired_drive.Tireddrv_status=0;
	   TiredConf_struct.Tired_drive.voicePly_timer=0;
	   TiredConf_struct.Tired_drive.voicePly_counter=0; 
	   memset((char*)(TiredConf_struct.Tired_drive.start_time),0,5);
	   memset((char*)(TiredConf_struct.Tired_drive.end_time),0,5);
	   TiredConf_struct.Tired_drive.Flag=0;
}

 void TIRED_DoorValue_Read(void)   //读时候要注意 有3个地方要清除 0
 {
 	  Api_Config_read(tired_config,0,(u8*)&TiredConf_struct,sizeof(TiredConf_struct));       

	 TiredConf_struct.Tired_drive.Tgvoice_play=0;
	 TiredConf_struct.Tired_drive.voicePly_counter=0;
	 TiredConf_struct.Tired_drive.voicePly_timer=0;
 }


u8   TIRED_CONF_Init(void)
{
    //  1.  clear
     memset((u8*)&(TiredConf_struct),0,sizeof(TiredConf_struct)); 	  // 驾驶员信息						

    // 2. stuff 
    TIRED_DoorValue_Init();
    TIRED_Drive_Init(); 	
 
    //    2. Operate
     return(Api_Config_write(tired_config,0,(u8*)&TiredConf_struct,sizeof(TiredConf_struct)));       

}

/*
         事件 
*/
//-----------------------------------------------------------------
void Event_Write_Init(void)
{
u8 len_write=8;
    //事件写入
    len_write=8;
       EventObj.Event_ID=1;//事件ID
	EventObj.Event_Len=len_write;//长度 4*2
	EventObj.Event_Effective=1;//事件有效
	memset(EventObj.Event_Str,0,sizeof(EventObj.Event_Str));
	memcpy(EventObj.Event_Str,"申请出车",EventObj.Event_Len);  
       Api_RecordNum_Write(event_808, EventObj.Event_ID, (u8*)&EventObj,sizeof(EventObj)); 

	len_write=16;
    EventObj.Event_ID=2;//事件ID
	EventObj.Event_Len=len_write;//长度 8*2
	memset(EventObj.Event_Str,0,sizeof(EventObj.Event_Str));
	memcpy(EventObj.Event_Str,"货己装齐准备启运",EventObj.Event_Len);  
          Api_RecordNum_Write(event_808, EventObj.Event_ID, (u8*)&EventObj,sizeof(EventObj)); 

	EventObj.Event_ID=3;//事件ID
	EventObj.Event_Len=len_write;//长度 8*2
	memset(EventObj.Event_Str,0,sizeof(EventObj.Event_Str));
	memcpy(EventObj.Event_Str,"平安到达一切顺利",EventObj.Event_Len);  
          Api_RecordNum_Write(event_808, EventObj.Event_ID, (u8*)&EventObj,sizeof(EventObj)); 
	
    EventObj.Event_ID=4;//事件ID
	EventObj.Event_Len=len_write;//长度 8*2
	memset(EventObj.Event_Str,0,sizeof(EventObj.Event_Str));
	memcpy(EventObj.Event_Str,"指定地点货未备齐",EventObj.Event_Len);  
          Api_RecordNum_Write(event_808, EventObj.Event_ID, (u8*)&EventObj,sizeof(EventObj)); 

	EventObj.Event_ID=5;//事件ID
	EventObj.Event_Len=len_write;//长度 8*2
	memset(EventObj.Event_Str,0,sizeof(EventObj.Event_Str));
	memcpy(EventObj.Event_Str,"指定地点无人接待",EventObj.Event_Len);  
          Api_RecordNum_Write(event_808, EventObj.Event_ID, (u8*)&EventObj,sizeof(EventObj)); 

	EventObj.Event_ID=6;//事件ID
	EventObj.Event_Len=len_write;//长度 8*2
	EventObj.Event_Effective=0;//事件有效
	memset(EventObj.Event_Str,0,sizeof(EventObj.Event_Str));
	memcpy(EventObj.Event_Str,"货到无法联系货主",EventObj.Event_Len);  
          Api_RecordNum_Write(event_808, EventObj.Event_ID, (u8*)&EventObj,sizeof(EventObj)); 

       len_write=14;
	EventObj.Event_ID=7;//事件ID
	EventObj.Event_Len=len_write;//长度 7*2
	memset(EventObj.Event_Str,0,sizeof(EventObj.Event_Str));
	memcpy(EventObj.Event_Str,"货到因货损拒收",EventObj.Event_Len);  
          Api_RecordNum_Write(event_808, EventObj.Event_ID, (u8*)&EventObj,sizeof(EventObj)); 

