nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Sys_config.c
	  if(Intype==0)
	  {
	    PhoneBook.Effective_Flag=1;  //有效标志位
           PhoneBook.CALL_TYPE=2; //类型定义为输出 
	    PhoneBook.NumLen=5;    // 号码长度
	    memset(PhoneBook.NumberStr,0,sizeof(PhoneBook.NumberStr)); // 号码内容
	    memcpy(PhoneBook.NumberStr,"10086",5);
		PhoneBook.UserLen=8;		// 用户名长度
	    memset(PhoneBook.UserStr,0,sizeof(PhoneBook.UserStr)); // 用户名内容
	    memcpy(PhoneBook.UserStr,"中国移动",8); 
		
	  } 
	  else
	  if(Intype==1)
		{
		   PhoneBook.Effective_Flag=0;  //有效标志位 
		   PhoneBook.CALL_TYPE=2; //类型定义为输出  
	       PhoneBook.NumLen=0;    // 号码长度
	       memset(PhoneBook.NumberStr,0,sizeof(PhoneBook.NumberStr));  
		   PhoneBook.UserLen=0;		
	       memset(PhoneBook.UserStr,0,sizeof(PhoneBook.UserStr)); 	
		}
	  
   for(i=0;i<8;i++)
   {
       	Api_RecordNum_Write(phonebook, i+1, (u8*)&PhoneBook,sizeof(PhoneBook)); 
   }
}

/*
       圆形围栏
*/
//---------------------------------------------------------- 
void  RailCycle_Init(void)
{
  u8 i=0;
  
   Rail_Cycle.Area_ID=0;
   Rail_Cycle.Area_attribute=0; // Bit 0  表示根据时间  该字段为0 表示围栏没有作用
   Rail_Cycle.Center_Latitude=0;
   Rail_Cycle.Center_Longitude=0;   
   Rail_Cycle.Radius=100; // 半径   
   Time2BCD(Rail_Cycle.StartTimeBCD);
   Time2BCD(Rail_Cycle.EndTimeBCD);
   Rail_Cycle.MaxSpd=100; // 最高速度
   Rail_Cycle.KeepDur=30; // 超速持续时间
   Rail_Cycle.Rail_Num=8;
   Rail_Cycle.Effective_flag=0; 

   for(i=0;i<8;i++)
   {
     Rail_Cycle.Area_ID=i+1;
     Api_RecordNum_Write(Rail_cycle,Rail_Cycle.Area_ID, (u8*)&Rail_Cycle,sizeof(Rail_Cycle)); 	 
   }
}
void  RailCycle_Read(void)   
{
  u8 i=0;

   for(i=0;i<8;i++)
   {
          Api_RecordNum_Read(Rail_cycle,i+1, (u8*)&Rail_Cycle,sizeof(Rail_Cycle)); 		  
		//  rt_kprintf("\r\n\r\n 圆形围栏 TYPE: %d    atrri=%d  lati: %d  longiti:%d  radicus:%d	maxspd: %d  keepdur:%d \r\n",Rail_Cycle.Area_ID,Rail_Cycle.Area_attribute,Rail_Cycle.Center_Latitude,Rail_Cycle.Center_Longitude,Rail_Cycle.Radius,Rail_Cycle.MaxSpd,Rail_Cycle.KeepDur);  
   }
}

/*
       矩形围栏
*/
void  RailRect_Init(void)
{
  u8 i=0;
  
   Rail_Rectangle.Area_ID=0;
   Rail_Rectangle.Area_attribute=0; // Bit 0  表示根据时间  该字段为0 表示围栏没有作用
   Rail_Rectangle.LeftUp_Latitude=0; // 左上
   Rail_Rectangle.LeftUp_Longitude=0;   
   Rail_Rectangle.RightDown_Latitude=0; //  右下 
   Rail_Rectangle.RightDown_Longitude=0;  
   Time2BCD(Rail_Rectangle.StartTimeBCD);
   Time2BCD(Rail_Rectangle.EndTimeBCD);
   Rail_Rectangle.MaxSpd=100; // 最高速度
   Rail_Rectangle.KeepDur=30; // 超速持续时间
   Rail_Rectangle.Rail_Num=8;  
   Rail_Rectangle.Effective_flag=0;

   for(i=0;i<8;i++)
   {
     Rail_Rectangle.Area_ID=i+1;
     Api_RecordNum_Write(Rail_rect,Rail_Rectangle.Area_ID, (u8*)&Rail_Rectangle,sizeof(Rail_Rectangle)); 	 
   }      
   
}

void  RailRect_Read(void)
{
  u8 i=0;

   for(i=0;i<8;i++)
   {
	 Api_RecordNum_Read(Rail_rect,i+1, (u8*)&Rail_Rectangle,sizeof(Rail_Rectangle)); 	 	  
        //  rt_kprintf("\r\n\r\n 矩形形围栏 TYPE: %d    atrri=%d  leftlati: %d  leftlongiti:%d    rightLati:%d   rightLongitu: %d  \r\n",Rail_Rectangle.Area_ID,Rail_Rectangle.Area_attribute,Rail_Rectangle.LeftUp_Latitude,Rail_Rectangle.LeftUp_Longitude,Rail_Rectangle.RightDown_Latitude,Rail_Rectangle.RightDown_Longitude);  
   }  
}  

/*
       多边形围栏
*/
void  RailPolygen_Init(void)
{
  u8 i=0;
  
   Rail_Polygen.Area_ID=0;
   Rail_Polygen.Area_attribute=0; // Bit 0  表示根据时间  该字段为0 表示围栏没有作用
   Time2BCD(Rail_Polygen.StartTimeBCD);
   Time2BCD(Rail_Polygen.EndTimeBCD);
   Rail_Polygen.MaxSpd=100; // 最高速度
   Rail_Polygen.KeepDur=30; // 超速持续时间
   Rail_Polygen.Acme_Num=3;   
   Rail_Polygen.Acme1_Latitude=10; //顶点1 
   Rail_Polygen.Acme1_Longitude=10;   
   Rail_Polygen.Acme2_Latitude=20; //顶点2
   Rail_Polygen.Acme2_Longitude=20;     
   Rail_Polygen.Acme3_Latitude=30; //顶点3
   Rail_Polygen.Acme3_Longitude=30;  
   Rail_Polygen.Effective_flag=0;

   for(i=0;i<8;i++)
   {
     Rail_Polygen.Area_ID=i+1;
     Api_RecordNum_Write(Rail_polygen,Rail_Polygen.Area_ID, (u8*)&Rail_Polygen,sizeof(Rail_Polygen)); 	 
   }
}

void  RailPolygen_Read(void)
{
  u8 i=0;

   for(i=0;i<8;i++)
   {
       Api_RecordNum_Read(Rail_polygen,i+1, (u8*)&Rail_Polygen,sizeof(Rail_Polygen)); 	 		  
       //  rt_kprintf("\r\n\r\n 多边形围栏 TYPE: %d   1lat: %d  1long:%d    2lat:%d   2long: %d  3lat:%d 3long:%d \r\n",Rail_Polygen.Area_ID,Rail_Polygen.Acme1_Latitude,Rail_Polygen.Acme1_Longitude,Rail_Polygen.Acme2_Latitude,Rail_Polygen.Acme2_Longitude,Rail_Polygen.Acme3_Latitude,Rail_Polygen.Acme3_Longitude);   
   }
} 

/*
        拐点设置    (Maybe Null)
*/
      




/*
        路线设置围栏 
*/
void  RouteLine_Obj_init(void)
{
  u8 i=0;
  
   ROUTE_Obj.Route_ID=0;
   ROUTE_Obj.Route_attribute=0; // Bit 0  表示根据时间  该字段为0 表示围栏没有作用
   Time2BCD(ROUTE_Obj.StartTimeBCD);
   Time2BCD(ROUTE_Obj.EndTimeBCD);
   ROUTE_Obj.Points_Num=3;   
   for(i=0;i<3;i++)
   	{
   	  ROUTE_Obj.RoutePoints[i].POINT_ID=i+1;
	  ROUTE_Obj.RoutePoints[i].Line_ID=i;
	  ROUTE_Obj.RoutePoints[i].POINT_Latitude=i+300;
	  ROUTE_Obj.RoutePoints[i].POINT_Longitude=i+500;
	  ROUTE_Obj.RoutePoints[i].Width=20;
	  ROUTE_Obj.RoutePoints[i].Atribute=0; // 0 表示未启用
	  ROUTE_Obj.RoutePoints[i].TooLongValue=100;
	  ROUTE_Obj.RoutePoints[i].TooLessValue=50;
	  ROUTE_Obj.RoutePoints[i].MaxSpd=60;
	  ROUTE_Obj.RoutePoints[i].KeepDur=3;
	  ROUTE_Obj.Effective_flag=0; 
   	}

}
 
 void  RouteLine_Init(void)
{
  u8 i=0;
  
    RouteLine_Obj_init();

   for(i=0;i<8;i++)
   {
     ROUTE_Obj.Route_ID=i+1;
     Api_RecordNum_Write(route_line,ROUTE_Obj.Route_ID, (u8*)&ROUTE_Obj,sizeof(ROUTE_Obj)); 	 
   }
}

void  RouteLine_Read(void)
{
  u8 i=0;

   for(i=0;i<8;i++)
   {
       Api_RecordNum_Read(route_line,i+1, (u8*)&ROUTE_Obj,sizeof(ROUTE_Obj)); 	 
	//  rt_kprintf("\r\n\r\n 路线 TYPE: %d   pointsNum:%d   p1lat: %d  p1long:%d    p2lat:%d   p2long: %d  p3lat:%d p3long:%d \r\n",ROUTE_Obj.Route_ID,ROUTE_Obj.Points_Num,ROUTE_Obj.RoutePoints[0].POINT_Latitude,ROUTE_Obj.RoutePoints[0].POINT_Longitude,ROUTE_Obj.RoutePoints[1].POINT_Latitude,ROUTE_Obj.RoutePoints[1].POINT_Longitude,ROUTE_Obj.RoutePoints[2].POINT_Latitude,ROUTE_Obj.RoutePoints[2].POINT_Longitude);   
   }
}    

