nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Sys_config.c
     	}
     rt_kprintf("\r\n   CAN1 :\r\n            CAN1  Mode:    %s      \r\n             CAN1  ID:    0x%08X      \r\n\r\n ",BD_str,BD_EXT.CAN_1_ID);  

      memset(BD_str,0,sizeof(BD_str));
     switch(BD_EXT.CAN_2_Mode&0x60000000)
     	{
     	    case 0x20000000: 
				memcpy(BD_str,"还回模式",8);
			        break;
	    case 0x40000000:
                           	memcpy(BD_str,"普通模式",8);
			        break;
	    case 0x6000000:
                           	memcpy(BD_str,"静默模式",8);
				break; 

     	}
     rt_kprintf("\r\n   CAN2 :\r\n            CAN2  Mode:    %s      \r\n             CAN2  ID:    0x%08X      \r\n\r\n ",BD_str,BD_EXT.CAN_2_ID);

     

}

//FINSH_FUNCTION_EXPORT(BD_list, BD status); 


void SendMode_Config(void)     //  发送方式设置 
{
     if(JT808Conf_struct.RT_LOCK.Lock_state==1)
     {
       JT808Conf_struct.SD_MODE.DUR_TOTALMODE=1;
       Current_SD_Duration=JT808Conf_struct.RT_LOCK.Lock_Dur;
	   if(JT808Conf_struct.RT_LOCK.Lock_KeepCnter>JT808Conf_struct.RT_LOCK.Lock_KeepDur)
	   	{
		   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
	   	} 
	   else	   
	      return;
     }
    if(1==JT808Conf_struct.SD_MODE.DUR_TOTALMODE)
    {
        
		if(1==JT808Conf_struct.SD_MODE.Dur_EmegencMode)
        {
            Current_SD_Duration=JT808Conf_struct.DURATION.Emegence_Dur;
			return;
        }
        if(1==JT808Conf_struct.SD_MODE.Dur_DefaultMode)
        {
            Current_SD_Duration=JT808Conf_struct.DURATION.Default_Dur;
			return;
        }
        if(1==JT808Conf_struct.SD_MODE.Dur_NologinMode)
        {
            Current_SD_Duration=JT808Conf_struct.DURATION.NoDrvLogin_Dur;
						return;
        }
		if(1==JT808Conf_struct.SD_MODE.Dur_SleepMode)
        {
            Current_SD_Duration=JT808Conf_struct.DURATION.Sleep_Dur;
			return;
        }

    }
	else
	if(1==JT808Conf_struct.SD_MODE.DIST_TOTALMODE)
	{
        if(1==JT808Conf_struct.SD_MODE.Dist_EmgenceMode) 
        {
            Current_SD_Distance=JT808Conf_struct.DISTANCE.Emergen_Dist;
			return;
        }
		if(1==JT808Conf_struct.SD_MODE.Dist_DefaultMode) 
        {
            Current_SD_Distance=JT808Conf_struct.DISTANCE.Defalut_DistDelta;
			return;
        }
        if(1==JT808Conf_struct.SD_MODE.Dist_NoLoginMode) 
        {
            Current_SD_Distance=JT808Conf_struct.DISTANCE.NoDrvLogin_Dist;
			return;
        }
	    if(1==JT808Conf_struct.SD_MODE.Dist_SleepMode) 
        {
            Current_SD_Distance=JT808Conf_struct.DISTANCE.Sleep_Dist; 
			return;
        }
	   
	}

}

void  SendMode_ConterProcess(void)         //  定时发送处理程序
{   //   发送方式计数器处理
   //  1. 心跳包计数器
    JT808Conf_struct.DURATION.Heart_SDCnter++;       
    if(JT808Conf_struct.DURATION.Heart_SDCnter>JT808Conf_struct.DURATION.Heart_Dur)  //超过心跳包设置的间隔
      	{
            JT808Conf_struct.DURATION.Heart_SDCnter=0;     
            JT808Conf_struct.DURATION.Heart_SDFlag=1; 
    	}
   //  2. 发送超时判断
   #if 0
    if(1==JT808Conf_struct.DURATION.TCP_SD_state)
    {
      JT808Conf_struct.DURATION.TCP_ACK_DurCnter++;
	  if(JT808Conf_struct.DURATION.TCP_ACK_DurCnter>JT808Conf_struct.DURATION.TCP_ACK_Dur) //发送应答定时
	  	{
          JT808Conf_struct.DURATION.TCP_ACK_DurCnter=0;
		  JT808Conf_struct.DURATION.Heart_SDFlag=1;         //重新发送
		  JT808Conf_struct.DURATION.TCP_ReSD_cnter++;
		  if(JT808Conf_struct.DURATION.TCP_ReSD_cnter>JT808Conf_struct.DURATION.TCP_ReSD_Num)  //重新发送次数判断
		  	{
               JT808Conf_struct.DURATION.TCP_ReSD_cnter=0;
			   Close_DataLink();   // AT_End();	   //挂断GPRS链接    

		  	}
	  	}
 
    }
   #endif  
}


//----------  
void  Rails_Routline_Read(void)
{
   u16  i=0;
   
            //-----------读取围栏状态-------
           
		   for(i=0;i<8;i++)
		   {
				Api_RecordNum_Read(Rail_rect,i+1, (u8*)&Rail_Rectangle_multi[i], sizeof(Rail_Rectangle));
				delay_ms(2);
				Api_RecordNum_Read(Rail_cycle,i+1, (u8*)&Rail_Cycle_multi[i],sizeof(Rail_Cycle));	

				
		   }  

} 


//-----------------------------------------------------------------

void  FirstRun_Config_Write(void)
{     //   程序首次更新是写配置操作 

       //  rt_kprintf("\r\n  sizeof(sysconfig): %d   sizeof(jt808): %d    sizeof(tiredconfig): %d   \r\n",sizeof(SysConf_struct),sizeof(JT808Conf_struct),sizeof(TiredConf_struct)); 
                  SysConfig_init();   //  写入系统配置信息
                  TIRED_CONF_Init(); //  写入疲劳驾驶相关配置信息
                 JT808_Conf_init();   //  写入 JT808   配置信息
                  Api_WriteInit_var_rd_wr();	
		    BD_EXT_initial(); 		  

			     
				 Vehicleinfo_Init();// 写入车辆信息
                 Event_Write_Init();
		   MSG_BroadCast_Write_Init();
		   PhoneBook_Init(0);  
		   RailCycle_Init();		   
		   RailRect_Init();
		   RailPolygen_Init();	
		   RouteLine_Init(); 
                 TEXTMSG_Write_Init();	   
				 
 		  //---- add special -----------  
 		  Login_Menu_Flag=0;     //  输入界面为0 
		  DF_WriteFlashSector(DF_LOGIIN_Flag_offset,0,&Login_Menu_Flag,1); 
		  

}
//-----------------------------------------------------------------
void SetConfig(void)
{
	//u8 i=0;//,len_write=0;
//	u32 j=0;
	
       rt_kprintf("\r\nSave Config\r\n");
	// 1.  读取config 操作      0 :成功    1 :  失败
	Api_Config_read(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));           
       //rt_kprintf("\r\nRead Save SYSID\r\n");
       //  2. 读取成功  ，判断  版本ID 
	if(SysConf_struct.Version_ID!=SYSID)//SYSID)   //  check  wether need  update  or not 
	{
	       rt_kprintf("\r\n ID not Equal   Saved==0x%X ,  Read==0x%X !\r\n",SYSID,SysConf_struct.Version_ID);	
	        SysConf_struct.Version_ID=SYSID;  // update  ID 
             //  2.1   先删除 
               // Delete_exist_Directory();
	     //  2.2  重新写入		 
           FirstRun_Config_Write();   // 里边更新了 SYSID           
           rt_kprintf("\r\nready--erase vdr!\r\n");
		   vdr_erase(); 
	  	   rt_kprintf("\r\nSave Over!\r\n"); 

	}
	else			
		   rt_kprintf("\r\n Config Already Exist!\r\n"); 
}

 void ReadConfig(void) 
{
    u16   res[3];
	
           DF_delay_ms(500);  
		  DF_LOCK=1;   // lock  df

		  //  1.   read  read to  compare  judge
          // Api_Config_read(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   //  读取JT808   配置信息
         //-------- JT808 参数配置读取测试，操作频繁而且重要所以需要特殊处理 
           DF_ReadFlash(JT808Start_offset, 0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
		   DF_delay_ms(80); 	// large content delay	

