nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Sys_config.c
		   DF_ReadFlash(JT808_BakSetting_offset, 0,(u8*)&JT808_struct_Bak,sizeof(JT808_struct_Bak)); 
		   DF_delay_ms(80); 	// large content delay	 

		   DF_ReadFlash(JT808_Bak2Setting_offset, 0,(u8*)&JT808_struct_Bak2,sizeof(JT808_struct_Bak2)); 
		   DF_delay_ms(80); 	// large content delay	

		   // 2. compare
		   /*
		           note:   res[0] == org cmp  bak    res[1]== bak  cmp  bak2    res[2]== bak2  cmp  org		  

		           ---org --<seg1>--  bak ---<seg2>----bak2 ---<seg3>---
		           |-----------<---------------<----------------------|
		    */
		   res[0]=memcmp((u8*)&JT808Conf_struct,(u8*)&JT808_struct_Bak,sizeof(JT808_struct_Bak));
		   res[1]=memcmp((u8*)&JT808_struct_Bak,(u8*)&JT808_struct_Bak2,sizeof(JT808_struct_Bak));
		   res[2]=memcmp((u8*)&JT808_struct_Bak2,(u8*)&JT808Conf_struct,sizeof(JT808_struct_Bak));

           // 3. judge 
           if(res[0]&&res[1]&&res[2])   // 全有问题
           	{
           	   rt_kprintf("\r\n JT808 全部失败!\r\n"); 	
			   rt_kprintf("\r\n need all recover"); 
	           JT808_Conf_init();	
           	}
		   else
		   if(res[0]&&res[1])   //    seg1  seg2  有问题说明  BAK error
		   	{    
		   	    // org  bak2 ---ok      bak---error
		   	   if((u8)(JT808Conf_struct.DURATION.Default_Dur>>24)!=0xFF) // 判断正确的是不是 FF
		   	   	{ 
		   	   	 
				  DF_WriteFlashSector(JT808_BakSetting_offset,0,(u8*)&JT808Conf_struct,sizeof(JT808_struct_Bak));
				  rt_kprintf("\r\n JT808 BAK error ,correct ok"); 			

		   	   	}
			   else
			   	{ 
			   	  rt_kprintf("\r\n need all recover 1"); 
				  JT808_Conf_init();
			   	}

		   	}
		   else
		   if(res[0]&&res[2])  //  seg1  seg3    有问题说明 BAK2  error
		   	{
		   	   // org  bak  ---ok       bak2 -----error
		   	   if((u8)(JT808Conf_struct.DURATION.Default_Dur>>24)!=0xFF) // 判断正确的是不是 FF
		   	   	{ 
		   	   	 
				  DF_WriteFlashSector(JT808_Bak2Setting_offset,0,(u8*)&JT808Conf_struct,sizeof(JT808_struct_Bak));
				  rt_kprintf("\r\n JT808 BAK2 error ,correct ok"); 			

		   	   	}
			   else
			   	{ 
			   	  rt_kprintf("\r\n need all recover 2"); 
				  JT808_Conf_init();
			   	}

		   	}
		   else
		   if(res[1]&&res[2])  //  seg2  seg3	 有问题说明 org  error
			{
			   //  bak  bak2 --ok     org---error
		         if((u8)(JT808_struct_Bak.DURATION.Default_Dur>>24)!=0xFF) // 判断正确的是不是 FF
		   	   	{ 
		   	   	 
				  DF_WriteFlashSector(JT808Start_offset,0,(u8*)&JT808_struct_Bak,sizeof(JT808_struct_Bak));
				  rt_kprintf("\r\n JT808 org error ,correct ok"); 	 		

		   	   	}
			   else
			   	{ 
			   	  rt_kprintf("\r\n need all recover 3"); 
				  JT808_Conf_init();
			   	}
		   
			} 
		   else
		   	rt_kprintf("\r\n JT808 读取校验成功! \r\n"); 
         //-------------------------------------------------------------------------------------
		   
		   SysConfig_Read();  //读取系统配置信息	                 
           TIRED_DoorValue_Read();          		   
           Event_Read();
		   MSG_BroadCast_Read();
		   PhoneBook_Read();  
		  // RailCycle_Read();
 		   //RailPolygen_Read();
 		   //RailRect_Read();
 		   //RouteLine_Read();   
                 TEXTMsg_Read();	 
                 BD_EXT_Read();   
		   Api_Read_var_rd_wr();	  	  	   

           //  Vechicle  compare
		   DF_ReadFlash(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));  
		   
		   WatchDog_Feed();
		   DF_ReadFlash(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info_BAK,sizeof(Vechicle_Info_BAK)); 

		   WatchDog_Feed();
		   DF_ReadFlash(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_info_BAK2,sizeof(Vechicle_info_BAK2)); 

		   //  compare
		   /*
		           note:   res[0] == org cmp  bak    res[1]== bak  cmp  bak2    res[2]== bak2  cmp  org		  

		           ---org --<seg1>--  bak ---<seg2>----bak2 ---<seg3>---
		           |-----------<---------------<----------------------|
		    */
		   res[0]=memcmp((u8*)&Vechicle_Info,(u8*)&Vechicle_Info_BAK,sizeof(Vechicle_Info_BAK));	
		   res[1]=memcmp((u8*)&Vechicle_Info_BAK,(u8*)&Vechicle_info_BAK2,sizeof(Vechicle_Info_BAK));
		   res[2]=memcmp((u8*)&Vechicle_info_BAK2,(u8*)&Vechicle_Info,sizeof(Vechicle_Info_BAK));

			// 3. judge 
			if(res[0]&&res[1]&&res[2])	 // 全有问题
			 {
				rt_kprintf("\r\n Vechicle全部失败! \r\n");	 
				rt_kprintf("\r\n need all recover"); 
				Vehicleinfo_Init();// 写入车辆信息	 
			 }
			else
			if(res[0]&&res[1])	 //    seg1  seg2  有问题说明  BAK error
			 {	  
				 // org  bak2 ---ok 	 bak---error
				if((u8)(Vechicle_Info.Dev_CityID>>8)!=0xFF) // 判断正确的是不是 FF
				{ 
				  DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
				  rt_kprintf("\r\n Vehicle BAK error ,correct ok");   
		   	   	}
			   else
			   	{ 
			   	  rt_kprintf("\r\n Vehicle need all recover 1"); 
				  Vehicleinfo_Init();
			   	}			
			 }
			else
			if(res[0]&&res[2])	//	seg1  seg3	  有问题说明 BAK2  error
			 {
				// org	bak  ---ok		 bak2 -----error
			    if((u8)(Vechicle_Info.Dev_CityID>>8)!=0xFF) // 判断正确的是不是 FF
				{ 
				  DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
				  rt_kprintf("\r\n Vehicle BAK2 error ,correct ok");   
		   	   	}
			   else
			   	{ 
			   	  rt_kprintf("\r\n Vehicle need all recover 2"); 
				  Vehicleinfo_Init();
			   	}
			
			 }
			else
			if(res[1]&&res[2])	//	seg2  seg3	  有问题说明 org  error
			 {
				//	bak  bak2 --ok	   org---error
			    	if((u8)(Vechicle_Info.Dev_CityID>>8)!=0xFF) // 判断正确的是不是 FF
				{ 
				  DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info_BAK,sizeof(Vechicle_Info_BAK)); 
				  rt_kprintf("\r\n Vehicle BAK error ,correct ok");   
		   	   	}
			   else
			   	{ 
			   	  rt_kprintf("\r\n Vehicle need all recover 3"); 
				  Vehicleinfo_Init();
			   	}
			
			 }
			else
				rt_kprintf("\r\n Vehicle 读取校验成功! \r\n");  
			//---- 设备ID  --------	 
		  // memset(DeviceNumberID,0,sizeof(DeviceNumberID));
		  // DF_ReadFlash(DF_DeviceID_offset,0,(u8*)DeviceNumberID,12);  
		   //读出车牌号是否设置标志
		   DF_ReadFlash(DF_License_effect,0,&License_Not_SetEnable,1); 
		   if(License_Not_SetEnable==1) 
		   	rt_kprintf("\r\n无牌照\r\n");  
		   //  ------ SIM ID  入网ID --------
		   memset(SimID_12D,0,sizeof(SimID_12D));
		   DF_ReadFlash(DF_SIMID_12D,0,(u8*)SimID_12D,12);  

		   //------  读取 录入状态-----------
		   DF_ReadFlash(DF_LOGIIN_Flag_offset,0,&Login_Menu_Flag,1); 
		   
