nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Sys_config.c
		}  
		    memset(Reg_buf,0,sizeof(Reg_buf));
		    memcpy(Reg_buf,JT808Conf_struct.ConfirmCode,20);
		    Reg_buf[20]=JT808Conf_struct.Regsiter_Status;		
                  Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
      }
}
//FINSH_FUNCTION_EXPORT(idip, id code set);


#if 0
void deviceid(u8 *str)
{

	  u8 i=0,value=0;
	  u8 reg_str[20];
	 
	    memset(reg_str,0,sizeof(reg_str));
	     if (strlen((const char*)str)==0){
		   rt_kprintf("\r\n 终端ID为 : "); 
		  for(i=0;i<12;i++)
		  	rt_kprintf("%c",DeviceNumberID[i]); 
		  rt_kprintf("\r\n");
			return ;
		}
		else 
		{	   
          //---- check -------
          memcpy(reg_str,str,strlen((const char*)str));	
          if(strlen((const char*)reg_str)==12)  //  长度判断
          {
             for(i=0;i<12;i++)
             	{ 
             	   if(!((reg_str[i]>='0')&&(reg_str[i]<='9')))
				   {
				       value=1;
					   break;
             	   } 
             	}

			 if(value)
			 	{
			 	  rt_kprintf("\r\ndevice_ContentError\r\n");
			 	  rt_kprintf("\r\n 手动设置终端ID不合法!  \r\n");   
                  return ;
			 	} 

          }
		  else
		  	{
		  	    rt_kprintf("\r\ndevice_LenError\r\n");
		  	    rt_kprintf("\r\n 手动设置终端ID 长度不正确!  \r\n");   
                return ;
		  	}	
		 
		  memset(DeviceNumberID,0,sizeof(DeviceNumberID));
		  memcpy(DeviceNumberID,reg_str,12);								 
		  DF_WriteFlashSector(DF_DeviceID_offset,0,DeviceNumberID,13); 
		  delay_ms(80);
		  
		  rt_kprintf("\r\ndevice_OK(");  
		  DF_ReadFlash(DF_DeviceID_offset,0,DeviceNumberID,13);    
		  for(i=0;i<12;i++)
		  	rt_kprintf("%c",DeviceNumberID[i]);
		  rt_kprintf(")\r\n"); 
		  rt_kprintf("\r\n手动终端ID设置为 :%s\r\n",DeviceNumberID);
	         return ;
		}
}
FINSH_FUNCTION_EXPORT(deviceid, deviceid set);  
#endif 


void simid(u8 *str)
{

	  u8 i=0,value=0;
	  u8 reg_str[20];
	 
	    memset(reg_str,0,sizeof(reg_str));
	     if (strlen((const char*)str)==0){
		   rt_kprintf("\r\n 入网 SIM_ID为 : ");  
		  for(i=0;i<12;i++)
		  	rt_kprintf("%c",SimID_12D[i]); 
		  rt_kprintf("\r\n");
			return ;
		}
		else 
		{	   
          //---- check -------
          memcpy(reg_str,str,strlen((const char*)str));	
          if(strlen((const char*)reg_str)==12)  //  长度判断
          {
             for(i=0;i<12;i++)
             	{ 
             	   if(!((reg_str[i]>='0')&&(reg_str[i]<='9')))
				   {
				       value=1;
					   break;
             	   } 
             	}

			 if(value)
			 	{
			 	  rt_kprintf("\r\n 手动设置入网SIM_ID不合法!  \r\n");   
                  return ;
			 	} 

          }
		  else
		  	{
		  	    rt_kprintf("\r\n 手动设置入网SIM_ID 长度不正确!  \r\n");   
                return ;
		  	}	
		 
		  memset(SimID_12D,0,sizeof(SimID_12D));
		  memcpy(SimID_12D,reg_str,12);								 
		  DF_WriteFlashSector(DF_SIMID_12D,0,SimID_12D,13); 
		  delay_ms(80); 		  
		  rt_kprintf("\r\n 手动设备入网Sim_ID设置为 : ");   
		  DF_ReadFlash(DF_SIMID_12D,0,SimID_12D,13);     
		  SIMID_Convert_SIMCODE();  // 转换 
		  for(i=0;i<12;i++)
		  	rt_kprintf("%c",SimID_12D[i]);
		  rt_kprintf("\r\n");
	         return ;
		}
}
FINSH_FUNCTION_EXPORT(simid, simid set); 













